Duet3D/Duet3Expansion/src/atmel/SAMDA1_DFP/1.2.50/samda1/atdf/ATSAMDA1G15A.atdf
        <module name="PTC" id="U2215" version="1.0.4">
          <instance name="PTC">
            <register-group name="PTC" name-in-module="PTC" address-space="base" offset="0x42004C00"/>
            <signals>
              <signal group="X" index="0" function="B_PTC" pad="PA08"/>
              <signal group="X" index="1" function="B_PTC" pad="PA09"/>
              <signal group="X" index="2" function="B_PTC" pad="PA10"/>
              <signal group="X" index="3" function="B_PTC" pad="PA11"/>
              <signal group="X" index="4" function="B_PTC" pad="PA16"/>
              <signal group="X" index="5" function="B_PTC" pad="PA17"/>
              <signal group="X" index="6" function="B_PTC" pad="PA18"/>
              <signal group="X" index="7" function="B_PTC" pad="PA19"/>
              <signal group="X" index="8" function="B_PTC" pad="PA20"/>
              <signal group="X" index="9" function="B_PTC" pad="PA21"/>
              <signal group="X" index="10" function="B_PTC" pad="PA22"/>
              <signal group="X" index="11" function="B_PTC" pad="PA23"/>
              <signal group="Y" index="0" function="B_PTC" pad="PA02"/>
              <signal group="Y" index="1" function="B_PTC" pad="PA03"/>
              <signal group="Y" index="2" function="B_PTC" pad="PA04"/>
              <signal group="Y" index="3" function="B_PTC" pad="PA05"/>
              <signal group="Y" index="4" function="B_PTC" pad="PA06"/>
              <signal group="Y" index="5" function="B_PTC" pad="PA07"/>
              <signal group="Y" index="8" function="B_PTC" pad="PB02"/>
              <signal group="Y" index="9" function="B_PTC" pad="PB03"/>
              <signal group="Y" index="14" function="B_PTC" pad="PB08"/>
              <signal group="Y" index="15" function="B_PTC" pad="PB09"/>
            </signals>
            <parameters>
              <param name="GCLK_ID" value="34"/>
              <param name="INSTANCE_ID" value="83"/>
            </parameters>
          </instance>
        </module>
        <module name="RTC" id="U2202" version="1.0.1">
          <instance name="RTC">
            <register-group name="RTC" name-in-module="RTC" address-space="base" offset="0x40001400"/>
            <parameters>
              <param name="ALARM_NUM" value="1"/>
              <param name="COMP16_NUM" value="2"/>
              <param name="COMP32_NUM" value="1"/>
              <param name="GCLK_ID" value="4"/>
              <param name="NUM_OF_ALARMS" value="1"/>
              <param name="NUM_OF_COMP16" value="2"/>
              <param name="NUM_OF_COMP32" value="1"/>
              <param name="INSTANCE_ID" value="5"/>
            </parameters>
          </instance>
        </module>
        <module name="SERCOM" id="U2201" version="2.2.0">
          <instance name="SERCOM0">
            <register-group name="SERCOM0" name-in-module="SERCOM" address-space="base" offset="0x42000800"/>
            <signals>
              <signal group="PAD" index="0" function="D" pad="PA04"/>
              <signal group="PAD" index="0" function="C" pad="PA08"/>
              <signal group="PAD" index="1" function="D" pad="PA05"/>
              <signal group="PAD" index="1" function="C" pad="PA09"/>
              <signal group="PAD" index="2" function="D" pad="PA06"/>
              <signal group="PAD" index="2" function="C" pad="PA10"/>
              <signal group="PAD" index="3" function="D" pad="PA07"/>
              <signal group="PAD" index="3" function="C" pad="PA11"/>
            </signals>
            <parameters>
              <param name="DMAC_ID_RX" value="1"/>
              <param name="DMAC_ID_TX" value="2"/>
              <param name="GCLK_ID_CORE" value="20"/>
              <param name="GCLK_ID_SLOW" value="19"/>
              <param name="INT_MSB" value="6"/>
              <param name="INSTANCE_ID" value="66"/>
            </parameters>
          </instance>
          <instance name="SERCOM1">
            <register-group name="SERCOM1" name-in-module="SERCOM" address-space="base" offset="0x42000C00"/>
            <signals>
              <signal group="PAD" index="0" function="C" pad="PA16"/>
              <signal group="PAD" index="0" function="D" pad="PA00"/>
              <signal group="PAD" index="1" function="C" pad="PA17"/>
              <signal group="PAD" index="1" function="D" pad="PA01"/>
              <signal group="PAD" index="2" function="D" pad="PA30"/>
              <signal group="PAD" index="2" function="C" pad="PA18"/>
              <signal group="PAD" index="3" function="D" pad="PA31"/>
              <signal group="PAD" index="3" function="C" pad="PA19"/>
            </signals>
            <parameters>
              <param name="DMAC_ID_RX" value="3"/>
              <param name="DMAC_ID_TX" value="4"/>
              <param name="GCLK_ID_CORE" value="21"/>
              <param name="GCLK_ID_SLOW" value="19"/>
              <param name="INT_MSB" value="6"/>
              <param name="INSTANCE_ID" value="67"/>
            </parameters>
          </instance>
          <instance name="SERCOM2">
            <register-group name="SERCOM2" name-in-module="SERCOM" address-space="base" offset="0x42001000"/>
            <signals>
              <signal group="PAD" index="0" function="D" pad="PA08"/>
              <signal group="PAD" index="0" function="C" pad="PA12"/>
              <signal group="PAD" index="1" function="D" pad="PA09"/>
              <signal group="PAD" index="1" function="C" pad="PA13"/>
              <signal group="PAD" index="2" function="D" pad="PA10"/>
              <signal group="PAD" index="2" function="C" pad="PA14"/>
              <signal group="PAD" index="3" function="D" pad="PA11"/>
              <signal group="PAD" index="3" function="C" pad="PA15"/>
            </signals>
            <parameters>
              <param name="DMAC_ID_RX" value="5"/>
              <param name="DMAC_ID_TX" value="6"/>
              <param name="GCLK_ID_CORE" value="22"/>
              <param name="GCLK_ID_SLOW" value="19"/>
              <param name="INT_MSB" value="6"/>
              <param name="INSTANCE_ID" value="68"/>
            </parameters>
          </instance>
          <instance name="SERCOM3">
            <register-group name="SERCOM3" name-in-module="SERCOM" address-space="base" offset="0x42001400"/>
            <signals>
              <signal group="PAD" index="0" function="D" pad="PA16"/>
              <signal group="PAD" index="0" function="C" pad="PA22"/>
              <signal group="PAD" index="1" function="D" pad="PA17"/>
              <signal group="PAD" index="1" function="C" pad="PA23"/>
              <signal group="PAD" index="2" function="D" pad="PA18"/>
              <signal group="PAD" index="2" function="D" pad="PA20"/>
              <signal group="PAD" index="2" function="C" pad="PA24"/>
              <signal group="PAD" index="3" function="D" pad="PA19"/>
              <signal group="PAD" index="3" function="D" pad="PA21"/>
              <signal group="PAD" index="3" function="C" pad="PA25"/>
            </signals>
            <parameters>
              <param name="DMAC_ID_RX" value="7"/>
              <param name="DMAC_ID_TX" value="8"/>
              <param name="GCLK_ID_CORE" value="23"/>
              <param name="GCLK_ID_SLOW" value="19"/>
              <param name="INT_MSB" value="6"/>
              <param name="INSTANCE_ID" value="69"/>
            </parameters>
          </instance>
          <instance name="SERCOM4">
            <register-group name="SERCOM4" name-in-module="SERCOM" address-space="base" offset="0x42001800"/>
            <signals>
              <signal group="PAD" index="0" function="D" pad="PA12"/>
              <signal group="PAD" index="0" function="D" pad="PB08"/>
              <signal group="PAD" index="1" function="D" pad="PA13"/>
              <signal group="PAD" index="1" function="D" pad="PB09"/>
              <signal group="PAD" index="2" function="D" pad="PA14"/>
              <signal group="PAD" index="2" function="D" pad="PB10"/>
              <signal group="PAD" index="3" function="D" pad="PA15"/>
              <signal group="PAD" index="3" function="D" pad="PB11"/>
            </signals>
            <parameters>
              <param name="DMAC_ID_RX" value="9"/>
              <param name="DMAC_ID_TX" value="10"/>
              <param name="GCLK_ID_CORE" value="24"/>
              <param name="GCLK_ID_SLOW" value="19"/>
              <param name="INT_MSB" value="6"/>
              <param name="INSTANCE_ID" value="70"/>
            </parameters>
          </instance>
          <instance name="SERCOM5">
            <register-group name="SERCOM5" name-in-module="SERCOM" address-space="base" offset="0x42001C00"/>
            <signals>
              <signal group="PAD" index="0" function="D" pad="PA22"/>
              <signal group="PAD" index="0" function="D" pad="PB02"/>
              <signal group="PAD" index="1" function="D" pad="PA23"/>
              <signal group="PAD" index="1" function="D" pad="PB03"/>
              <signal group="PAD" index="2" function="D" pad="PA24"/>
              <signal group="PAD" index="2" function="D" pad="PB22"/>
              <signal group="PAD" index="2" function="C" pad="PA20"/>
              <signal group="PAD" index="3" function="D" pad="PA25"/>
              <signal group="PAD" index="3" function="D" pad="PB23"/>
              <signal group="PAD" index="3" function="C" pad="PA21"/>
            </signals>
            <parameters>
              <param name="DMAC_ID_RX" value="11"/>
              <param name="DMAC_ID_TX" value="12"/>
              <param name="GCLK_ID_CORE" value="25"/>
              <param name="GCLK_ID_SLOW" value="19"/>
              <param name="INT_MSB" value="6"/>
              <param name="INSTANCE_ID" value="71"/>
            </parameters>
          </instance>
        </module>
        <module name="SYSCTRL" id="U2100" version="2.0.1">
          <instance name="SYSCTRL">
            <register-group name="SYSCTRL" name-in-module="SYSCTRL" address-space="base" offset="0x40000800"/>
            <signals>
              <signal group="XIN" function="XIN" pad="PA14"/>
              <signal group="XIN32" function="XIN32" pad="PA00"/>
              <signal group="XOUT" function="XOUT" pad="PA15"/>
              <signal group="XOUT32" function="XOUT32" pad="PA01"/>
            </signals>
            <parameters>
              <param name="BGAP_CALIB_MSB" value="11"/>
              <param name="BOD33_CALIB_MSB" value="5"/>
              <param name="DFLL48M_COARSE_MSB" value="5"/>
              <param name="DFLL48M_FINE_MSB" value="9"/>
              <param name="GCLK_ID_DFLL48" value="0"/>
              <param name="GCLK_ID_FDPLL" value="1"/>
              <param name="GCLK_ID_FDPLL32K" value="2"/>
              <param name="OSC32K_COARSE_CALIB_MSB" value="6"/>
              <param name="POR33_ENTEST_MSB" value="1"/>
              <param name="SYSTEM_CLOCK" value="1000000"/>
              <param name="ULPVREF_DIVLEV_MSB" value="3"/>
              <param name="ULPVREG_FORCEGAIN_MSB" value="1"/>
              <param name="ULPVREG_RAMREFSEL_MSB" value="2"/>
              <param name="VREF_CONTROL_MSB" value="48"/>
              <param name="VREF_STATUS_MSB" value="7"/>
              <param name="VREG_LEVEL_MSB" value="2"/>
              <param name="BOD12_VERSION" value="0x112"/>
              <param name="BOD33_VERSION" value="0x112"/>
              <param name="DFLL48M_VERSION" value="0x301"/>
              <param name="FDPLL_VERSION" value="0x111"/>
              <param name="OSCULP32K_VERSION" value="0x111"/>
              <param name="OSC8M_VERSION" value="0x120"/>
              <param name="OSC32K_VERSION" value="0x112"/>
              <param name="VREF_VERSION" value="0x201"/>
              <param name="VREG_VERSION" value="0x201"/>
              <param name="XOSC_VERSION" value="0x114"/>
              <param name="XOSC32K_VERSION" value="0x113"/>
              <param name="INSTANCE_ID" value="2"/>
            </parameters>
          </instance>
        </module>
